winbond-secure-flash/w77x-compat-suite/platform/NXP1050_setup/nxp_10xx_bsp/bsp_src/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D12_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D12_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D12_CHANNEL                                     16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCDIF_D12_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D12_GPIO_PIN                                    16U   /*!< GPIO pin number */
#define BOARD_INITPINS_LCDIF_D12_GPIO_PIN_MASK                       (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LCDIF_D12_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D12_PIN                                         16U   /*!< PORT pin number */
#define BOARD_INITPINS_LCDIF_D12_PIN_MASK                            (1U << 16U)   /*!< PORT pin mask */

/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D13_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D13_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D13_CHANNEL                                     17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCDIF_D13_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D13_GPIO_PIN                                    17U   /*!< GPIO pin number */
#define BOARD_INITPINS_LCDIF_D13_GPIO_PIN_MASK                       (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LCDIF_D13_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D13_PIN                                         17U   /*!< PORT pin number */
#define BOARD_INITPINS_LCDIF_D13_PIN_MASK                            (1U << 17U)   /*!< PORT pin mask */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D14_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D14_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D14_CHANNEL                                     18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCDIF_D14_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D14_GPIO_PIN                                    18U   /*!< GPIO pin number */
#define BOARD_INITPINS_LCDIF_D14_GPIO_PIN_MASK                       (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LCDIF_D14_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D14_PIN                                         18U   /*!< PORT pin number */
#define BOARD_INITPINS_LCDIF_D14_PIN_MASK                            (1U << 18U)   /*!< PORT pin mask */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D15_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D15_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D15_CHANNEL                                     19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCDIF_D15_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D15_GPIO_PIN                                    19U   /*!< GPIO pin number */
#define BOARD_INITPINS_LCDIF_D15_GPIO_PIN_MASK                       (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LCDIF_D15_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D15_PIN                                         19U   /*!< PORT pin number */
#define BOARD_INITPINS_LCDIF_D15_PIN_MASK                            (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D9_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D9_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_D9_CHANNEL                                        24U   /*!< Signal channel */

