winbond-secure-flash/w77x-compat-suite/platform/NXP1050_setup/nxp_10xx_bsp/bsp_src/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CSI_D9_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CSI_D9_GPIO_PIN                                       24U   /*!< GPIO pin number */
#define BOARD_INITPINS_CSI_D9_GPIO_PIN_MASK                          (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CSI_D9_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CSI_D9_PIN                                            24U   /*!< PORT pin number */
#define BOARD_INITPINS_CSI_D9_PIN_MASK                               (1U << 24U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D6_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D6_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_D6_CHANNEL                                        27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CSI_D6_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CSI_D6_GPIO_PIN                                       27U   /*!< GPIO pin number */
#define BOARD_INITPINS_CSI_D6_GPIO_PIN_MASK                          (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CSI_D6_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CSI_D6_PIN                                            27U   /*!< PORT pin number */
#define BOARD_INITPINS_CSI_D6_PIN_MASK                               (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/CSI_D5/J35[5]/U13[16] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D5_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D5_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_D5_CHANNEL                                        28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CSI_D5_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CSI_D5_GPIO_PIN                                       28U   /*!< GPIO pin number */
#define BOARD_INITPINS_CSI_D5_GPIO_PIN_MASK                          (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CSI_D5_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CSI_D5_PIN                                            28U   /*!< PORT pin number */
#define BOARD_INITPINS_CSI_D5_PIN_MASK                               (1U << 28U)   /*!< PORT pin mask */

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_TX_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_TX_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN2_TX_CHANNEL                                       14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN2_TX_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN2_TX_GPIO_PIN                                      14U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN2_TX_GPIO_PIN_MASK                         (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN2_TX_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN2_TX_PIN                                           14U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN2_TX_PIN_MASK                              (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/CSI_D4/J35[3]/U13[14] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D4_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D4_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_D4_CHANNEL                                        29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CSI_D4_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CSI_D4_GPIO_PIN                                       29U   /*!< GPIO pin number */
#define BOARD_INITPINS_CSI_D4_GPIO_PIN_MASK                          (1U << 29U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CSI_D4_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CSI_D4_PIN                                            29U   /*!< PORT pin number */
#define BOARD_INITPINS_CSI_D4_PIN_MASK                               (1U << 29U)   /*!< PORT pin mask */

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D3_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D3_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_D3_CHANNEL                                        30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CSI_D3_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CSI_D3_GPIO_PIN                                       30U   /*!< GPIO pin number */
#define BOARD_INITPINS_CSI_D3_GPIO_PIN_MASK                          (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CSI_D3_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CSI_D3_PIN                                            30U   /*!< PORT pin number */
#define BOARD_INITPINS_CSI_D3_PIN_MASK                               (1U << 30U)   /*!< PORT pin mask */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D2_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D2_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_D2_CHANNEL                                        31U   /*!< Signal channel */

