winbond-secure-flash/w77x-compat-suite/platform/NXP1050_setup/nxp_10xx_bsp/bsp_src/board/pin_mux.h
/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D0_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D0_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D0_CHANNEL                                    0U   /*!< Signal channel */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CMD_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CMD_SIGNAL                             usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CLK_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CLK_SIGNAL                             usdhc_clk   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_CLK_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_CLK_SIGNAL                    FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_D2_A_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_D2_A_SIGNAL                  FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_D0_A_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_D0_A_SIGNAL                  FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_D1_A_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_D1_A_SIGNAL                  FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_SS0_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_SS0_SIGNAL                   FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_D3_A_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_D3_A_SIGNAL                  FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_DQS_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_DQS_SIGNAL                     FLEXSPI_A_DQS   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlashPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
